{
  "data-science-projects": [
    {
      "title": "Sleep State Prediction",
      "description": "Conducted exploratory analysis, focusing on minute-based event labelling, identification of missing labels, and detection of duplicate data within series. Utilised logistic regression and random forest models for time series classification. Additionally, experimented with CNN/ResNet models for classification, evaluating their effectiveness in the given context.",
      "link": "https://github.com/sschepanski/data-science-portfolio/tree/main/Sleep_States"
    },
    {
      "title": "Health Insurance Costs",
      "description": "Employed different regression models (Linear, Ridge, Lasso, Decision Tree, Random Forest, XGBoost, LightGBM, SVM) to predict the financial burden of insurance and identify important features responsible for these high costs. Explored the relationship between personal attributes, geographic factors, and their impact on medical insurance charges.",
      "link": "https://github.com/sschepanski/data-science-portfolio/tree/main/Health_Insurance"
    },
    {
      "title": "Stroke Prediction",
      "description": "This project focuses on developing a machine learning model for predicting the likelihood of stroke events based on 11 clinical features. The dataset used for this analysis is the Stroke Prediction Dataset, which includes essential information to predict whether a patient is likely to experience a stroke.",
      "link": "https://github.com/sschepanski/data-science-portfolio/tree/main/Stroke_Prediction"
    },
    {
      "title": "Heart Attack Analysis & Prediction",
      "description": "Used various models (KNN, Logistic Regression, SVM, Decision Tree, Random Forest, XGBoost) to predict the most important feature that predicts heart attacks. Assessed accuracy, precision, recall, and F1-Score for each model.",
      "link": "https://github.com/sschepanski/data-science-portfolio/tree/main/Heart_attack_prediction"
    },
    {
      "title": "Sales Prediction",
      "description": "Utilised time series analysis techniques, investigating seasonality and stationarity with aroma, Holt-Winters forecasting, auto ARIMA, and SARIMAX. Explored historical trends, allowing adjustments for past sales patterns and external environmental factors when predicting the next 6 months of total sales.",
      "link": "https://github.com/sschepanski/data-science-portfolio/tree/main/Time_Series_Analysis"
    },
    {
      "title": "Kickstarter",
      "description": "Utilised Random Forest and XGBoost for predicting the number of backers needed for being successful in a Kickstarter campaign. The project progressed from extensive exploratory data analysis to predicting and hyperparameter tuning.",
      "link": "https://github.com/sschepanski/data-science-portfolio/tree/main/Kickstarter_Prediction"
    },
    {
      "title": "Diabetes Onset",
      "description": "Utilised logistic regression and decision tree to predict the onset of diabetes in a dataset, including hyperparameter tuning. Evaluated model performance through accuracy, precision, recall, and F1-Score.",
      "link": "https://github.com/sschepanski/data-science-portfolio/tree/main/Diabetes_Prediction"
    },
    {
      "title": "YouTube EDA",
      "description": "Aims to provide the music agency with valuable insights into the factors influencing the likelihood of their music videos becoming trending on YouTube. Employed exploratory data analysis techniques for a comprehensive understanding.",
      "link": "https://github.com/sschepanski/data-science-portfolio/tree/main/YouTube_EDA_challenge"
    }
  ],
  "experimental-research-projects": [
    {
      "title": "Prenatal Modulators and Cognitive Outcomes: A Literature Review",
      "description": "We systematically examine observational studies, synthesising evidence on how maternal distress and infections impact immune-endocrine adaptations during pregnancy. We delve into the intricacies of brain development in mice and humans, introducing innovative perspectives on the correlation between altered adaptations and cognitive outcomes in offspring. This review offers a comprehensive exploration of the literature, shedding light on the intricate dynamics of prenatal influences on cognitive development.",
      "link": "https://doi.org/10.3389/fimmu.2018.02186"
    },
    {
      "title": "Maternal Immune Support: Enhancing the Defences of the Baby after Pregnancy",
      "description": "We applied MeDIP-Seq to profile the epigenetics of hematopoietic stem cells (HSC) in offspring exposed to varying levels of maternal immune support. We identified Differentially Methylated Regions (DMRs) and conducted gene ontology analyses using diffreps. For microbiome analysis, we employed degenerate primers and used QIIME for OTU clustering and diversity analysis. Statistical assessments, such as Mann–Whitney-U tests and Spearman correlations, were utilised for robust data interpretation.",
      "link": "https://doi.org/10.1038/s41467-021-24719-z"
    },
    {
      "title": "How the First COVID-19 Wave Influenced Early Motherhood in Northern Germany",
      "description": "We employed a single-centre cross-sectional design to assess the influence of the initial COVID-19 wave on maternal mental health. Various statistical methods, including one-way ANOVA, non-parametric tests, and multiple regression, were applied for comprehensive data analysis. The study focused on thorough statistical computations, ensuring a rigorous evaluation of psychological and sociodemographic variables.",
      "link": "https://doi.org/10.1080/02646838.2021.2013458"
    },
    {
      "title": "Impact of COVID-19 Conditions on Infants and Maternal Mental Health",
      "description": "Our statistical analysis incorporated descriptive statistics, univariate ANOVA, Mann–Whitney-U-Test, χ2-Test, and regression-based moderation analyses. To address missing data, we used Expectation Maximization estimation. Robust statistical assessments provided a detailed exploration of the impact of COVID-19 conditions on both infants and maternal mental health.",
      "link": "https://doi.org/10.3389/fpsyg.2021.805543"
    },
    {
      "title": "Nurturing Minds: How Mum’s Cells Guide Healthy Brain Development",
      "description": "Our project harnessed scRNA-sequencing data to explore the role of maternal cells in guiding healthy brain development. Seurat facilitated clustering analysis, and differential gene expression analysis was carried out with MAST. RNA sequencing and subsequent bioinformatic analyses, including Welch’s method and bootstrapping, provided insights into the molecular mechanisms. Integrating both scRNA-seq and RNA-seq data enabled a comprehensive understanding of gene expression dynamics.",
      "link": "https://doi.org/10.1038/s41467-022-32230-2"
    },
    {
      "title": "Maternal Transfer of Pathogen-Specific T Cells Boosts Neonatal Immunity in Mice",
      "description": "Statistical analyses, including unpaired Students' t-Test, Mann–Whitney-U test, Ordinary one-way ANOVA, and Kruskal–Wallis test, were employed to evaluate the impact of maternal transfer of pathogen-specific T cells on neonatal immunity. Robust regression and outlier removal techniques ensured the reliability of our results.",
      "link": "https://doi.org/10.15252/embr.202356829"
    },
    {
      "title": "Predicting Early Respiratory Infections and Childhood Asthma via Fetal Lung Growth",
      "description": "In our data science-driven approach, we predicted respiratory infections and childhood asthma risk. We utilised statistical analyses such as Chi-squared and Mann–Whitney U tests, Poisson regression, and machine learning algorithms like K-Nearest Neighbours, Random Forest, and eXtreme Gradient Boosting. Feature importance was assessed using SHapley Additive exPlanations (SHAP) values, ensuring a robust predictive model.",
      "link": ""
    }
  ]
}
