{
  "data-science-projects": [
    {
      "title": "Placeholder: Kaggle Competition - Capstone Project",
      "description": "This project explores the principles of physics.",
      "link": "#"
    },
    {
      "title": "Placeholder: Health insurance",
      "description": "A chemistry experiment to investigate chemical reactions.",
      "link": "https://example.com/project2"
    },
    {
      "title": "Placeholder: Stroke prediction",
      "description": "An astronomy project to study the stars and galaxies.",
      "link": "https://example.com/project3"
    },
    {
      "title": "Placeholder: StockX Sneaker Data Contest",
      "description": "An astronomy project to study the stars and galaxies.",
      "link": "https://example.com/project3"
    },
    {
      "title": "Placeholder: Time Series Analysis",
      "description": "An astronomy project to study the stars and galaxies.",
      "link": "https://example.com/project3"
    },
    {
      "title": "Placeholder: Kickstarter Challenge",
      "description": "An astronomy project to study the stars and galaxies.",
      "link": "https://example.com/project3"
    },
    {
      "title": "Placeholder: Diabetes Challenge",
      "description": "An astronomy project to study the stars and galaxies.",
      "link": "https://example.com/project3"
    },
    {
      "title": "Placeholder: YouTube EDA Challenge",
      "description": "An astronomy project to study the stars and galaxies.",
      "link": "https://example.com/project3"
    }
  ],
  "experimental-research-projects": [
    {
      "title": "Understanding How a Mother’s Experiences Shape a Child’s Brain and it's future Function",
      "description": "Challenges faced by mothers before birth, such as stress and infections, can influence a child’s cognitive development. This happens through the transfer of maternal substances to the foetus, including immune cells, impacting not only immediate brain development but potentially influencing brain function across generations.",
      "link": "https://doi.org/10.3389/fimmu.2018.02186"
    },
    {
      "title": "Maternal Immune Support: Enhancing the Defenses of the Baby after Pregnancy",
      "description": "Mothers pass immune cells to their babies during pregnancy, enhancing fetal immune development and providing protection against infections in early life. Higher numbers of these maternal immune cells correlate with increased resilience against infections, shedding light on a new dimension of maternal-fetal immune transfer that goes beyond antibodies, potentially influencing the newborn’s health and immunity.",
      "link": "https://doi.org/10.1038/s41467-021-24719-z"
    },
    {
      "title": "Nurturing Minds: How Mom’s Cells Guide Healthy Brain Development",
      "description": "Maternal cells transferred during pregnancy play a vital role in shaping the developing brain. These cells unique markers, regulate microglia (brain immune cells), and contribute to the maturation of neural circuits, ultimately influencing lifelong brain functions and behaviour. This reveals that the transfer of these cells is not just a byproduct of pregnancy but are active participants in creating a foundation for optimal brain health.",
      "link": "https://doi.org/10.1038/s41467-022-32230-2"
    },
    {
      "title": "Motherhood in a Time of Pandemic: Insights into Maternal Well-being and Infant Development",
      "description": "Investigating the impact of COVID-19 pandemic on early motherhood, we found comparable mental health outcomes but noted higher dissatisfaction with the maternal role during the pandemic. Focusing on infants at 7 months after birth, we found increased mantel depressive symptoms associated with infants experiencing more sleeping and crying issues, indicating potential long-term effects.",
      "link": "https://doi.org/10.1080/02646838.2021.2013458"
    }
  ]
}
